{
    "input": {
        "days": 3,
        "gender": "male",
        "height_in_cm": 165.0,
        "age": 20,
        "weight_in_kg": 60.0,
        "activity_level_number": 7,
        "health_goal": "weightGain",
        "dietary_restrictions": [
            "Dairy Free"
        ],
        "included_ingredients": [
            "nuts"
        ],
        "excluded_ingredients": [
            "carrots"
        ],
        "total_calorie_limit": 9202.0
    },
    "output": {
        "Day 1": {
            "Breakfast": {
                "directions": [
                    "1. For the lentils, put them in a saucepan, cover with water, bring to a boil the reduce the heat and simmer for about 15–20 minutes, or until all the liquid has evaporated and the lentils are not mushy and still with a bite.",
                    "2. As soon as the lentils are cooked transfer them to a large bowl and leave to cool.",
                    "3. Once the lentils are cool, add the beetroot, spring onions, hazelnuts and herbs and stir until everything is combined.",
                    "4. For the dressing, put the ginger, mustard, oil and vinegar in a bowl and, using a hand-held blender, blend until combined.",
                    "5. Drizzle the dressing over the salad and serve."
                ],
                "fat": 46.0,
                "date": "2015-07-30T04:00:00.000Z",
                "categories": [
                    "Low Fat",
                    "Kid-Friendly",
                    "Dinner",
                    "Lunch",
                    "Lentil",
                    "Beet",
                    "Summer",
                    "Healthy",
                    "Vegan",
                    "Hazelnut",
                    "Vegetarian",
                    "Pescatarian",
                    "Dairy Free",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 813.0,
                "desc": "Nourish your body with this welcoming salad complete with a warming ginger dressing. Lentils provide a fabulous source of protein and the beet adds that splash of color I love so much.",
                "protein": 28.0,
                "rating": 3.75,
                "title": "Lentil, Beetroot and Hazelnut Salad With a Ginger Dressing ",
                "ingredients": [
                    "1 cup Puy lentils, rinsed",
                    "2 3/4 cup filtered water",
                    "Sea salt",
                    "3 cooked beetroot, cut into small cubes",
                    "2 spring onions, finely sliced",
                    "2 tablepoons hazelnuts, roughly chopped",
                    "A handful of fresh mint, roughly chopped",
                    "A handful of fresh parsley, roughly chopped",
                    "3/4-inch cube of fresh ginger, peeled and roughly chopped",
                    "6 tablepoons olive oil",
                    "1 teaspoon Dijon mustard",
                    "1 tablespoon apple cider vinegar",
                    "Pinch of sea salt and freshly ground black pepper"
                ],
                "sodium": 225.0
            },
            "Lunch": {
                "directions": [
                    "Rinse the rice in a sieve under cold running water until the water runs clear; put to one side.",
                    "Heat the olive oil in a large, heavy-bottomed pot and throw in the onions. Cook over medium heat until they soften and turn golden. Season the chicken thighs and add them to the pan. Brown on all sides, then pour in 2 1/2 cups water and bring to a simmer. Cover with a lid and cook until the chicken is tender, about 20 minutes.",
                    "Meanwhile, peel the zest from the orange with a potato peeler, then cut it into matchstick strips. Blanch in a small pan of boiling water for a couple of minutes, then drain.",
                    "Dissolve the sugar in 1/2 cup (scant) water in a small, heavy-bottomed pan over medium heat, then bring to a boil and let bubble to reduce and thicken for 5 to 10 minutes until syrupy. Add the orange zest, slivered almonds, and pistachios and boil for 5 minutes, skimming off any froth. Strain the syrup and return to the pan; set aside the orange zest and nuts. Add the saffron and rose water to the syrup and boil again for 3 minutes, then add the cardamom seeds.",
                    "Preheat the oven to 300 degrees F. Strain the stock from the chicken thighs and add the syrup to it. Make this up to 3 cups with more water. Bring it to a boil in an ovenproof casserole and add the rice. Season and add two-thirds of the orange zest and nuts, keeping the rest to one side. Bring back to a boil, then cover and simmer until the rice is cooked. The liquid should have all been absorbed by now.",
                    "Bury the chicken and onions in the rice and add the fava beans and peas, if you are including them. Put the lid on and cook in the oven for 20 minutes.",
                    "Serve straight from the pan or, if you prefer, in a large, warmed serving dish. Sprinkle the last third of the orange zest and nuts over the top before bringing it to the table."
                ],
                "fat": 73.0,
                "date": "2010-04-06T04:00:00.000Z",
                "categories": [
                    "Chicken",
                    "Citrus",
                    "Fruit",
                    "Nut",
                    "Poultry",
                    "Dinner",
                    "Casserole/Gratin",
                    "Orange",
                    "Tree Nut",
                    "Almond",
                    "Pistachio",
                    "Spice",
                    "Saffron",
                    "Potluck",
                    "Advance Prep Required",
                    "Dairy Free",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 1172.0,
                "desc": "Here is a jewel of an Afghani dish. Unusual and exotic, it is one I cook regularly, sometimes with shoulder of lamb instead of chicken thighs. I serve it with slow-cooked spinach, finished with leeks and a minuscule amount of rhubarb. This may sound strange, but the rhubarb is sweetened by the leeks and it really does work.",
                "protein": 54.0,
                "rating": 4.375,
                "title": "Braised Chicken and Rice with Orange, Saffron, Almond, and Pistachio Syrup ",
                "ingredients": [
                    "1 1/2 cups brown basmati rice",
                    "1/4 cup olive oil",
                    "2 medium onions, peeled and minced",
                    "coarse salt and black pepper",
                    "4 large chicken thighs, chopped in half, or 8 smaller ones",
                    "about 4 cups water",
                    "1 large organic orange",
                    "1 tablespoon unrefined granulated sugar",
                    "1/2 cup slivered blanched almonds",
                    "1/2 cup shelled, chopped pistachio nuts",
                    "large pinch of saffron threads",
                    "2 to 3 teaspoons rose water",
                    "7 or 8 cardamom pods, lightly crushed, seeds extracted",
                    "a handful of blanched, skinned baby fava beans (optional)",
                    "a handful of blanched peas (optional)"
                ],
                "sodium": 220.0
            },
            "Dinner": {
                "directions": [
                    "Bring water to a simmer in a small saucepan, then stir in mushrooms and simmer 10 minutes. Cool to room temperature, then strain through a sieve into a large bowl. Discard stems, then chill mushroom caps, covered, until ready to braise chicken. Stir remaining marinade ingredients into mushroom liquid, then add chicken and marinate, chilled, stirring occasionally, 1 day.",
                    "Remove chicken from marinade and pat dry (discard marinade).",
                    "Heat oil in a 12-inch heavy nonstick skillet over medium-high heat until hot. Just before browning each batch of chicken, sprinkle with 1 teaspoon kosher salt. Brown, skin side down first, about 3 minutes per side. Transfer to a plate.",
                    "Pour off all but 1 tablespoon oil from skillet, then reduce heat to medium-low and sauté ginger, stirring, 1 minute (do not brown). Add white wine and Shaoxing and boil until reduced by three fourths, about 5 minutes. Add broth, 1 1/2 cups water, sugar, soy sauce, white pepper, and remaining 2 teaspoons kosher salt and bring to a simmer.",
                    "Combine cornstarch and remaining 2 tablespoons cold water and whisk into sauce, then boil 1 minute.",
                    "Transfer chicken, skin side up, to a 6-to 8-quart heavy pot (place white meat on top). Add sauce, chestnuts, and reserved mushroom caps. Gently simmer, covered, until chicken is just cooked through, 15 to 25 minutes.",
                    "Cut breasts in half and return to pot. Add ham. Gently simmer 3 minutes more."
                ],
                "fat": 55.0,
                "date": "2008-09-16T04:00:00.000Z",
                "categories": [
                    "Chicken",
                    "Ginger",
                    "Braise",
                    "Marinate",
                    "Dinner",
                    "Lunar New Year",
                    "Ham",
                    "Chestnut",
                    "Party",
                    "Gourmet",
                    "Dairy Free",
                    "Peanut Free"
                ],
                "calories": 936.0,
                "desc": "Ginger and Shaoxing rice wine give a deep, round intensity to chicken, turning it into something sumptuous. The salty savor of country ham and chewy, dense chestnuts help make each forkful a hit.",
                "protein": 70.0,
                "rating": 4.375,
                "title": "Braised Chicken with Smoked Ham, Chestnuts, and Ginger ",
                "ingredients": [
                    "2 3/4 cups water",
                    "12 dried Chinese black mushrooms",
                    "1/2 teaspoon white pepper",
                    "2 teaspoons kosher salt, divided",
                    "1 tablespoon soy sauce",
                    "2 teaspoon sugar",
                    "1 cup sliced peeled ginger",
                    "1/4 cup Shaoxing wine or dry Oloroso Sherry",
                    "1/4 cup dry white wine",
                    "2 small chickens (2 1/2 to 3 pounds), each cut into 6 pieces (legs, thighs, and breasts without backbones)",
                    "2 3/4 cups water",
                    "2 tablespoons corn oil",
                    "1 tablespoon plus 2 teaspoon kosher salt, divided",
                    "1/4 cup finely julienned peeled ginger",
                    "1/2 cup dry white wine",
                    "3/4 cup Shaoxing wine or dry Oloroso Sherry",
                    "3/4 cup dry Oloroso Sherry",
                    "2 1/2 cups reduced-sodium chicken broth",
                    "1 1/2 cups plus 2 tablespoon cold water, divided",
                    "3 1/2 teaspoons sugar",
                    "2 tablespoons soy sauce",
                    "1 teaspoon white pepper",
                    "2 tablespoons cornstarch",
                    "7 to 8 ounces bottled roasted chestnuts",
                    "1/4 pound thinly sliced country ham or speck",
                    "Accompaniment: steamed jasmine rice"
                ],
                "sodium": 2805.0
            },
            "Snacks": {
                "directions": [
                    "In a large skillet sauté the garlic in the oil over moderately high heat, stirring, until it is golden and discard it. To the skillet add the escarole, the olives, the raisins, and salt and pepper to taste and sauté the mixture, stirring, for 1 minute. Cook the mixture, covered, over moderately low heat for 4 minutes, or until the escarole is tender, stir in the pine nuts, and boil the mixture for 1 minute, or until the liquid is evaporated."
                ],
                "fat": 16.0,
                "date": "2004-08-20T12:48:48.000Z",
                "categories": [
                    "Olive",
                    "Side",
                    "Sauté",
                    "Vegetarian",
                    "Quick & Easy",
                    "Raisin",
                    "Pine Nut",
                    "Vegan",
                    "Escarole",
                    "Gourmet",
                    "Sugar Conscious",
                    "Pescatarian",
                    "Paleo",
                    "Dairy Free",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Soy Free",
                    "No Sugar Added",
                    "Kosher"
                ],
                "calories": 193.0,
                "desc": "Can be prepared in 45 minutes or less.",
                "protein": 3.0,
                "rating": 3.125,
                "title": "Escarole with Olives, Raisins, and Pine Nuts ",
                "ingredients": [
                    "1 garlic clove, sliced",
                    "2 tablespoons olive oil",
                    "1 pound escarole, trimmed, cut into bite-size pieces, rinsed well, and  spun dry",
                    "1 tablespoon dried Kalamata or other brine-cured black olives",
                    "2 teaspoons golden raisins",
                    "2 teaspoons pine nuts, toasted lightly"
                ],
                "sodium": 36.0
            }
        },
        "Day 2": {
            "Breakfast": {
                "directions": [
                    "Start by cutting up the melons: Trim off the rind of all 3 melons, remove any seeds, and cut the flesh into 1/2-inch dice. Put all of the diced melon in a large mixing bowl.",
                    "In a separate bowl, combine the ginger, sesame seeds, lime juice, soy sauce, 1/4 cup of the olive oil, 2 tablespoons of the sugar, and 1/2 teaspoon of the salt. Mix well and pour over the melon. Toss, and let marinate at room temperature while you prepare the rest of the salad.",
                    "Put the lentils and 4 cups cold water in a small saucepan set over high heat, and bring to a boil, about 5 minutes. Reduce the heat to low and simmer for 15 minutes. Add 1 teaspoon of the salt and cook for 5 minutes, or until the lentils are tender but not mushy. Drain, rinse with cold water to chill, and then stir into the melon mixture.",
                    "Combine the coconut, peanuts, kaffir lime, remaining 1 teaspoon sugar, remaining 1/4 cup olive oil, and remaining 1/4 teaspoon salt in a large sauté pan. Toast the peanut mixture over medium-low heat, stirring it constantly, until the coconut and peanuts have toasted, somewhat unevenly, to a golden brown, 3 to 4 minutes. Remove from the heat and set aside to cool.",
                    "Just before serving, add the peanut mixture to the melon mixture and stir gently to combine. Serve in a large bowl, preferably at room temperature."
                ],
                "fat": 55.0,
                "date": "2012-08-22T04:00:00.000Z",
                "categories": [
                    "Salad",
                    "Fruit",
                    "Ginger",
                    "Vegetarian",
                    "Lunch",
                    "Melon",
                    "Cantaloupe",
                    "Honeydew",
                    "Watermelon",
                    "Lentil",
                    "Healthy",
                    "Vegan",
                    "Soy Sauce",
                    "Lime Juice",
                    "Pescatarian",
                    "Dairy Free",
                    "Tree Nut Free",
                    "Kosher"
                ],
                "calories": 821.0,
                "desc": "If it's melon season, you have to make this. In Burma (Myanmar), gin thoke, meaning \"ginger mix,\" is a blend of crispy fried garlic, sesame seeds, and ginger, and is eaten as a sweet digestive snack after meals. Although not native to the region, melons are a refreshing and delicious complement to this dressing, together making a perfect summertime side dish. The ginger is key to this salad. Ideally, the gingerroot should be so young that the skin is almost transparent and the roots are tipped with pink.",
                "protein": 22.0,
                "rating": 0.0,
                "title": "Burmese Gin Thoke Melon Salad ",
                "ingredients": [
                    "1/2 small seedless watermelon (2 1/2 pounds)",
                    "1/2 ripe cantaloupe melon (1 1/2 pounds)",
                    "1/4 ripe honeydew melon (1 pound)",
                    "2 (3-inch) pieces young ginger,* peeled and minced (1/3 cup); or 2 (3-inch) pieces regular fresh ginger, peeled and minced (1/3 cup)",
                    "1/4 cup sesame seeds, toasted",
                    "1/4 cup lime juice (from 3 to 4 limes)",
                    "1/4 cup low-sodium soy sauce",
                    "1/2 cup extra virgin olive oil",
                    "2 tablespoons plus 1 teaspoon sugar",
                    "1 3/4 teaspoons kosher salt",
                    "1 cup dried green lentils",
                    "2 cups wide-flake unsweetened coconut",
                    "1 1/4 cups blanched raw peanuts",
                    "4 fresh kaffir lime leaves, chopped**"
                ],
                "sodium": 993.0
            },
            "Lunch": {
                "directions": [
                    "Bring fish sauce to a boil in a medium saucepan and cook until reduced almost by half (it will darken and become pungent), about 5 minutes. Stir in sugar and fit saucepan with thermometer. Cook until thermometer registers 230°F (mixture will become thick and dark). Whisk in crab paste and 1 tablespoons water until smooth. Reduce heat to low; keep warm until ready to dip wings.",
                    "Fit a large pot with clean thermometer and pour in oil to measure 2\". Heat over medium-high heat until thermometer registers 350°F.",
                    "Meanwhile, whisk flour, baking powder, and 1 cup cornstarch in a medium bowl. Whisking constantly, gradually add vodka and 1 3/4 cups water, adding more water if batter is too thick (it should be slightly thinner than cream but thicker than milk).",
                    "Place remaining 1/2 cup cornstarch in a shallow dish. Season chicken with salt and pepper and dredge in cornstarch, shaking off excess.",
                    "Working in 3 batches and returning oil to 350°F between batches, coat chicken in batter, letting excess drip back into bowl, and fry until skin is golden and chicken is crisp and cooked through, about 5 minutes. Transfer to a wire rack set inside a baking sheet to drain. Using tongs, add hot wings to warm caramel, turn to coat, then transfer wings to a platter. Serve wings topped with peanuts and cilantro.",
                    "Caramel sauce can be made 3 days ahead. Keep airtight at room temperature. Reheat before using."
                ],
                "fat": 35.0,
                "date": "2014-08-19T04:00:00.000Z",
                "categories": [
                    "Vodka",
                    "Chicken",
                    "Dinner",
                    "Peanut",
                    "Deep-Fry",
                    "Cilantro",
                    "Bon Appétit",
                    "Dairy Free",
                    "Tree Nut Free",
                    "Soy Free"
                ],
                "calories": 1160.0,
                "desc": "Don't worry.you won't need to buy any crabs to make these mind-altering wings. The crab flavor comes from a jarred condiment that's pretty easy to find at Asian markets; if not, use the shrimp version.",
                "protein": 49.0,
                "rating": 5.0,
                "title": "Crab Fat-Caramel Wings ",
                "ingredients": [
                    "1/2 cup fish sauce",
                    "1 1/2 cups sugar",
                    "1/4 cup Thai crab or shrimp paste with bean oil",
                    "Peanut or vegetable oil (for frying; about 10 cups)",
                    "1 cup all-purpose flour",
                    "1 teaspoon baking powder",
                    "1 1/2 cups cornstarch, divided",
                    "1/2 cup vodka",
                    "2 pounds chicken wings, tips removed, flats and drumettes separated",
                    "Kosher salt",
                    "Freshly ground pepper",
                    "1/4 cup chopped salted, roasted peanuts",
                    "Fresh cilantro leaves with tender stems (for serving)",
                    "A deep-fry thermometer"
                ],
                "sodium": 3110.0
            },
            "Dinner": {
                "directions": [
                    "In a kettle combine the black beans with enough cold water to cover them by 2 inches, simmer them, covered, for 1 hour, or until they are tender, and drain them well. While the beans are cooking, in a large saucepan combine the barley with 4 cups boiling salted water and simmer it, covered, for 45 minutes, or until it is cooked but still al dente. Drain the barley in a colander, rinse it, and drain it well. In a small bowl whisk together the lemon juice, the mustard, and salt and pepper to taste, add the oil in a stream, whisking, and whisk the dressing until it is emulsified. In a large bowl combine the black beans, the barley, and the onion, add the dressing, and toss the salad until it is combined well. The salad may be prepared up to this point 1 day in advance and kept covered and chilled. In a saucepan of boiling salted water cook the green beans for 4 to 5 minutes, or until they are just tender, refresh them under cold water, and drain them well. Cut the beans crosswise into 1/4-inch pieces, add them to the salad with pine nuts and salt and pepper to taste, and toss the salad until it is combined well. Serve the salad chilled or at room temperature.",
                    "In a colander rinse the beans under cold water and discard any discolored ones. In a kettle combine the beans with enough cold water to cover them by 2 inches, bring the water to a boil, and boil the beans for 2 minutes. Remove the kettle from the heat and let the beans soak, covered, for 1 hour."
                ],
                "fat": 37.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Salad",
                    "Bean",
                    "Mustard",
                    "Onion",
                    "Side",
                    "Low Fat",
                    "Vegetarian",
                    "High Fiber",
                    "Lemon",
                    "Pine Nut",
                    "Barley",
                    "Gourmet",
                    "Vegan",
                    "Pescatarian",
                    "Dairy Free",
                    "Peanut Free",
                    "Soy Free",
                    "No Sugar Added",
                    "Kosher"
                ],
                "calories": 909.0,
                "desc": null,
                "protein": 37.0,
                "rating": 3.75,
                "title": "Two-Bean and Barley Salad with Pine Nuts ",
                "ingredients": [
                    "1 pound dried black beans, soaked in enough cold water to cover them by 2 inches overnight or quick-soaked (procedure follows) and drained",
                    "1 cup barley (not quick-cooking)",
                    "6 tablespoons fresh lemon juice",
                    "1 tablespoon Dijon-style mustard",
                    "3/4 cup olive oil",
                    "1 1/2 cups finely chopped red onion",
                    "1 pound green beans, trimmed",
                    "1/2 cup pine nuts, toasted lightly",
                    "1/2 to 1 pound dried beans, picked over"
                ],
                "sodium": 51.0
            },
            "Snacks": {
                "directions": [
                    "In a blender or mini-processor purée 1 tablespoon of the walnuts with the vinegar, the oil, and salt and pepper to taste. In a steamer set over boiling water steam beans, covered, for 5 to 8 minutes, or until they are crisp-tender, transfer them to a bowl, and toss them with the dressing and the remaining chopped walnuts."
                ],
                "fat": 18.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Salad",
                    "Blender",
                    "Side",
                    "Steam",
                    "Low Fat",
                    "Quick & Easy",
                    "Walnut",
                    "Green Bean",
                    "Gourmet",
                    "Vegan",
                    "Vegetarian",
                    "Pescatarian",
                    "Paleo",
                    "Dairy Free",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Soy Free",
                    "No Sugar Added",
                    "Kosher"
                ],
                "calories": 219.0,
                "desc": "Can be prepared in 45 minutes or less.",
                "protein": 4.0,
                "rating": 2.5,
                "title": "Warm Green Bean and Walnut Salad ",
                "ingredients": [
                    "2 tablespoons walnuts, toasted lightly and chopped fine",
                    "2 teaspoons white-wine vinegar",
                    "2 tablespoons olive oil",
                    "3/4 pound green beans, trimmed and cut into 3/4-inch pieces"
                ],
                "sodium": 11.0
            }
        },
        "Day 3": {
            "Breakfast": {
                "directions": [
                    "Working in batches by type, cook beans in a large pot of boiling salted water until crisp-tender, 1–4 minutes. Transfer with a slotted spoon to a large bowl of ice water; let cool. Drain and pat dry.",
                    "Heat 1 tablespoon oil in a small skillet over medium and cook shallot, stirring occasionally, until tender, about 3 minutes. Add ginger, lemongrass, garlic, and coriander and cook, stirring, until very fragrant, about 1 minute. Transfer to a large bowl; season with salt and pepper.",
                    "Heat 1 tablespoon oil in same skillet over medium-high. Cook peanuts, tossing often, until golden brown and fragrant, about 2 minutes. Transfer to paper towels; let cool, then coarsely chop. Set aside 1 tablespoon peanuts for serving.",
                    "Whisk kaffir lime leaves, lime zest, lime juice, sugar, 1/2 teaspoon salt, and remaining 3 tablespoons oil into shallot mixture. Add beans, remaining peanuts, and 1/3 cup cilantro and toss to coat; season with salt and pepper. Serve topped with more cilantro and reserved peanuts."
                ],
                "fat": 56.0,
                "date": "2015-07-28T04:00:00.000Z",
                "categories": [
                    "Ginger",
                    "Side",
                    "Kid-Friendly",
                    "Lime",
                    "Peanut",
                    "Summer",
                    "Healthy",
                    "Low Cholesterol",
                    "Vegan",
                    "Sugar Snap Pea",
                    "Bon Appétit",
                    "Vegetarian",
                    "Pescatarian",
                    "Dairy Free",
                    "Wheat/Gluten-Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 748.0,
                "desc": "This is a high-summer throw together of a sauté to make when there are lots of snap beans at the market. Mix colors and types for the full effect.",
                "protein": 51.0,
                "rating": 5.0,
                "title": "Mixed Beans with Peanuts, Ginger, and Lime ",
                "ingredients": [
                    "2 pounds mixed snap beans (such as green, wax, haricots verts, and/or Romano), trimmed",
                    "1/2 teaspoon kosher salt, plus more",
                    "5 tablespoons olive oil, divided",
                    "1/2 large shallot, finely chopped",
                    "1 (1\" piece) ginger, peeled, finely grated",
                    "1 lemongrass stalk, tough outer layers removed, finely grated on a Microplane",
                    "2 garlic cloves, finely grated",
                    "1/2 teaspoon ground coriander",
                    "Freshly ground black pepper",
                    "1/3 cup salted, roasted peanuts",
                    "3 kaffir lime leaves, finely chopped",
                    "1 teaspoon finely grated lime zest",
                    "3 tablespoons fresh lime juice",
                    "1/4 teaspoon sugar",
                    "1/3 cup (packed) cilantro leaves with tender stems, plus more for serving"
                ],
                "sodium": 2171.0
            },
            "Lunch": {
                "directions": [
                    "Bring 2 inches of water with 2 teaspoons salt to a boil in a 2-quart heavy saucepan. Add chicken and poach at a bare simmer, partially covered, until just cooked through, 12 to 14 minutes.",
                    "While chicken poaches, whisk together lemon juice, honey, and 1/2 teaspoon salt in a bowl until honey and salt have dissolved. Whisk in shallot and oil, then whisk in apple.",
                    "Divide lettuce, grapes, walnuts, and celery between 2 plates and drizzle with half of vinaigrette. Slice chicken and put on top of salads, then drizzle with remaining vinaigrette."
                ],
                "fat": 76.0,
                "date": "2009-06-18T04:00:00.000Z",
                "categories": [
                    "Salad",
                    "Chicken",
                    "Quick & Easy",
                    "Lunch",
                    "Apple",
                    "Walnut",
                    "Celery",
                    "Healthy",
                    "Grape",
                    "Gourmet",
                    "Dairy Free",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 1188.0,
                "desc": "Although this main-course salad sounds suspiciously Waldorfesque—it includes walnuts, celery, and apple—the fresh vinaigrette gives it a modern flair that sets it apart from its mayonnaise-dressed muse.",
                "protein": 97.0,
                "rating": 4.375,
                "title": "Walnut Chicken Salad with Green Apple Vinaigrette ",
                "ingredients": [
                    "2 skinless boneless chicken breast halves (about 1 pound)",
                    "2 tablespoons fresh lemon juice",
                    "1 1/2 teaspoons mild honey",
                    "2 tablespoons finely chopped shallot",
                    "5 tablespoons olive oil",
                    "1/3 cup finely diced Granny Smith apple",
                    "1 small head Boston or Bibb lettuce (1/4 pound), leaves separated and left whole",
                    "1 cup seedless red grapes, halved if desired",
                    "1/2 cup walnuts (4 ounces), toasted",
                    "1 celery rib, thinly sliced"
                ],
                "sodium": 499.0
            },
            "Dinner": {
                "directions": [
                    "Toss together all ingredients in a large bowl until combined well."
                ],
                "fat": 51.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Salad",
                    "Chicken",
                    "Fruit",
                    "No-Cook",
                    "Quick & Easy",
                    "Lunch",
                    "Mayonnaise",
                    "Walnut",
                    "Summer",
                    "Tarragon",
                    "Grape",
                    "Gourmet",
                    "Paleo",
                    "Dairy Free",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 743.0,
                "desc": null,
                "protein": 52.0,
                "rating": 4.375,
                "title": "Chicken Salad with Grapes and Walnuts ",
                "ingredients": [
                    "4 cups cubed (1/2 inch) cooked chicken (about 1 3/4 pound)",
                    "1 cup walnuts,toasted and chopped",
                    "1 celery rib, cut into 1/4-inch-thick slices (1 cup)",
                    "2 tablespoons finely chopped shallot",
                    "2 cups halved seedless red grapes",
                    "3/4 cup mayonnaise",
                    "3 tablespoons tarragon vinegar",
                    "2 tablespoons finely chopped fresh tarragon",
                    "1/2 teaspoon salt",
                    "1/2 teaspoon black pepper"
                ],
                "sodium": 716.0
            },
            "Snacks": {
                "directions": [
                    "Preheat the oven to 325°F, and grease two 8x4×2 1/2-inch loaf pans.",
                    "In the bowl of an electric mixer, beat the eggs until foamy. Add the vegetable oil, sugar, zucchini, and vanilla extract and mix well. Add the flour, cinnamon, baking soda, salt, and baking powder, and mix until well blended. Stir in the nuts. Divide the batter evenly between the prepared loaf pans, and tap them gently on the counter to release any air bubbles.",
                    "Bake until the loaves have risen and are golden brown and a tester inserted into the center comes out clean, 55–60 minutes. Allow the bread to cool in the pans for 5 minutes; then turn the loaves out onto wire racks to cool.",
                    "Serve the bread warm, sliced and spread with cream cheese if desired."
                ],
                "fat": 14.0,
                "date": "2016-06-27T20:38:15.486Z",
                "categories": [
                    "HarperCollins",
                    "Bread",
                    "Cake",
                    "Zucchini",
                    "Breakfast",
                    "Brunch",
                    "Dessert",
                    "Summer",
                    "Cinnamon",
                    "Nut",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Dairy Free",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 300.0,
                "desc": "Though we call this a bread, it’s really more of a spice cake that uses grated fresh zucchini as a surprise ingredient. Serve it warm for breakfast, with cream cheese or butter and honey.",
                "protein": 4.0,
                "rating": 5.0,
                "title": "Spiced Zucchini Bread ",
                "ingredients": [
                    "3 eggs",
                    "3/4 cup vegetable oil",
                    "1 1/2 cups sugar",
                    "2 cups grated unpeeled zucchini",
                    "2 teaspoons vanilla extract",
                    "2 1/2 cups all-purpose flour",
                    "1 tablespoon ground cinnamon",
                    "3/4 teaspoon baking soda",
                    "3/4 teaspoon salt",
                    "1/4 teaspoon baking powder",
                    "3/4 cup chopped lightly toasted walnuts or pecans",
                    "Cream cheese, at room temperature, for serving (optional)"
                ],
                "sodium": 216.0
            }
        }
    }
}