{
    "input": {
        "days": 7,
        "gender": "female",
        "height_in_cm": 164.0,
        "age": 20,
        "weight_in_kg": 68.0,
        "activity_level_number": 3,
        "health_goal": "maintainWeight",
        "dietary_restrictions": [
            "Vegetarian",
            "Dairy Free",
            "Wheat/Gluten Free"
        ],
        "included_ingredients": [
            "nuts",
            "eggs"
        ],
        "excluded_ingredients": [
            "carrots"
        ],
        "total_calorie_limit": 12837.0
    },
    "output": {
        "Day 1": {
            "Breakfast": {
                "directions": [
                    "Set a medium rice cooker to the regular cycle or to quick cook if it's a fuzzy-logic machine. Heat the olive oil and sauté the spring onion for 1 minute. Add the asparagus and cook for another 3 minutes, or until the asparagus begins to soften. In a medium mixing bowl, whisk together the eggs, cream, salt, and Tabasco. Pour the egg mixture over the asparagus and sprinkle with the goat cheese.",
                    "Cover the rice cooker and reset to the regular cycle. The frittata will take 3 to 4 minutes to cook. Allow it to continue steaming, covered, for an additional 6 minutes on the keep-warm setting or with the machine turned off. (Many rice cookers, including all fuzzy-logic machines, do this automatically.) Serve warm or at room temperature."
                ],
                "fat": 41.0,
                "date": "2015-05-13T04:00:00.000Z",
                "categories": [
                    "Egg",
                    "Breakfast",
                    "Brunch",
                    "Kid-Friendly",
                    "Goat Cheese",
                    "Asparagus",
                    "Spring",
                    "Quick and Healthy",
                    "Sugar Conscious",
                    "Vegetarian",
                    "Pescatarian",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "No Sugar Added",
                    "Kosher"
                ],
                "calories": 482.0,
                "desc": "When I put these ingredients in my rice cooker, I knew the flavors would complement each other, but I wondered what the dish would look like. It was lovely! The soft, melting goat cheese mingled with the asparagus and creamy eggs. The frittata makes a great light supper or lunch dish; serve it with a fruit salad.",
                "protein": 24.0,
                "rating": 0.0,
                "title": "Asparagus and Goat Cheese Frittata ",
                "ingredients": [
                    "1 Tbsp olive oil",
                    "1 Tbsp spring onion or green onion, white part only, finely chopped",
                    "1/2 lb asparagus, trimmed and cut into 1/2-in/12-mm pieces",
                    "4 large eggs",
                    "1/3 cup heavy cream",
                    "1 tsp salt",
                    "1/4 tsp Tabasco sauce",
                    "1/2 cup crumbled goat cheese"
                ],
                "sodium": 1533.0
            },
            "Lunch": {
                "directions": [
                    "Butter a 1 1/2-quart soufflé dish and dust it with 1/4 cup of the Parmesan. In a large heavy saucepan cook the onion and the garlic with salt and pepper to taste in the butter over moderately low heat, stirring, until the onion is softened, stir in the flour, and cook the roux, stirring, for 3 minutes. Add the milk in a stream, whisking, and simmer the mixture, whisking, until it is thickened. Remove the pan from the heat, whisk in the Gruyère, whisking until the cheese is melted, and whisk in the sweet potatoes and the egg yolks, 1 at a time. In a bowl with an electric mixer beat the egg whites with a pinch of salt until they just hold stiff peaks, whisk one fourth of them into the sweet potato mixture to lighten it, and fold in the remaining whites gently but thoroughly. Pour the mixture into the prepared soufflé dish, sprinkle the remaining 1/4 cup Parmesan over it, and bake the soufflé in the middle of a preheated 375°F. oven for 45 to 50 minutes, or until it is puffed and golden. Serve the soufflé immediately."
                ],
                "fat": 25.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Cheese",
                    "Egg",
                    "Side",
                    "Bake",
                    "Vegetarian",
                    "Sweet Potato/Yam",
                    "Fall",
                    "Gourmet"
                ],
                "calories": 651.0,
                "desc": null,
                "protein": 28.0,
                "rating": 4.375,
                "title": "Sweet Potato and Gruyère Soufflé ",
                "ingredients": [
                    "1/2 cup freshly grated Parmesan",
                    "1 cup finely chopped onion",
                    "1 large garlic clove, minced",
                    "2 tablespoons unsalted butter",
                    "2 tablespoons all-purpose flour",
                    "1 cup milk",
                    "1 cup coarsely grated Gruyère (about 3 ounces)",
                    "2 cups mashed cooked sweet potatoes (about 1 1/2 pounds)",
                    "4 large eggs, separated"
                ],
                "sodium": 674.0
            },
            "Dinner": {
                "directions": [
                    "1. In a large saucepan, bring the broth to a boil.",
                    "2. Add the orzo, rice, or pastina and cook until tender but still al dente, about 7 minutes (20, if using rice). Season with the salt and pepper and reduce heat to low; simmer.",
                    "3. Meanwhile, in a medium bowl, whisk together the eggs and lemon juice until smooth.",
                    "4. Ladle about 1 cup of the hot broth into the egg-and-lemon mixture, then whisk to combine.",
                    "5. Add the mixture back to the simmering saucepan. Stir just until the soup becomes opaque and thickens as the eggs cook, 1 to 2 minutes. Add more salt and pepper, if desired, and serve."
                ],
                "fat": 7.0,
                "date": "2009-03-17T04:00:00.000Z",
                "categories": [
                    "Chicken",
                    "Egg",
                    "Kid-Friendly",
                    "Quick & Easy",
                    "Lunch",
                    "Lemon",
                    "Simmer",
                    "Orzo",
                    "Cookie",
                    "Dairy Free",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "No Sugar Added",
                    "Kosher"
                ],
                "calories": 167.0,
                "desc": "A classic Greek soup that's thickened with eggs and spiked with lemon. Add some shredded rotisserie chicken and call it a meal.",
                "protein": 12.0,
                "rating": 4.375,
                "title": "Avgolemono ",
                "ingredients": [
                    "4 cups chicken broth",
                    "1/4 cup uncooked orzo (or rice or pastina)",
                    "Salt and pepper to taste",
                    "3 eggs",
                    "3 tablespoons lemon juice"
                ],
                "sodium": 978.0
            },
            "Snacks": {
                "directions": [
                    "Combine first 4 ingredients in processor. Using on/off turns, cut in butter and shortening until mixture resembles coarse meal. Blend in orange juice and enough water by tablespoonfuls to form moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic and chill 1 hour. (Can be prepared 1 day ahead. Keep refrigerated. Soften dough slightly at room temperature before rolling.) Preheat oven to 350° F. Roll out dough on lightly floured surface to 12-inch-diameter round. Transfer to 9-inch-diameter glass pie dish. Trim edges and crimp decoratively. Freeze 15 minutes. Line crust with foil; fill with dried beans or pie weights. Bake 15 minutes. Remove foil and beans. Bake crust until pale golden, about 10 minutes. Cool on rack.",
                    "Melt butter in heavy small saucepan over medium heat. Stir in cocoa, then cream and espresso powder. Pour into large bowl. Add corn syrup, sugar, eggs, vanilla and salt; whisk until well blended. Stir in pecans. Pour filling into pie crust. Bake until puffed and set, about 1 hour. Transfer to rack and cool completely. (Can be made 1 day ahead. Cover and let stand at room temperature.)",
                    "Cut pie into wedges. Transfer to plates. Serve with dollops of Coffee Whipped Cream."
                ],
                "fat": 29.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Coffee",
                    "Liqueur",
                    "Milk/Cream",
                    "Food Processor",
                    "Chocolate",
                    "Nut",
                    "Dessert",
                    "Thanksgiving",
                    "Pecan",
                    "Fall",
                    "Bon Appétit",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 535.0,
                "desc": "Cocoa, espresso and orange add a sophisticated note to a classic pecan pie.",
                "protein": 6.0,
                "rating": 4.375,
                "title": "Mocha Pecan Pie with Coffee Whipped Cream ",
                "ingredients": [
                    "1 1/4 cups all purpose flour",
                    "1 tablespoon grated orange peel",
                    "1 teaspoon sugar",
                    "1/4 teaspoon salt",
                    "1/4 cup (1/2 stick) chilled unsalted butter, cut into small pieces",
                    "1/4 cup solid vegetable shortening, cut into small pieces",
                    "1 tablespoon orange juice",
                    "2 tablespoons (about) ice water",
                    "3 tablespoons unsalted butter",
                    "3 tablespoons unsweetened cocoa powder",
                    "1 tablespoon whipping cream",
                    "2 teaspoons instant espresso powder or instant coffee powder",
                    "1 cup light corn syrup",
                    "1 cup sugar",
                    "3 large eggs",
                    "2 teaspoons vanilla extract",
                    "1/4 teaspoon salt",
                    "1 1/2 cups coarsely chopped pecans (about 6 ounces)",
                    "1 cup chilled whipping cream",
                    "3 tablespoons coffee liqueur",
                    "1 tablespoon powdered sugar"
                ],
                "sodium": 166.0
            }
        },
        "Day 2": {
            "Breakfast": {
                "directions": [
                    "Bring coconut milk to boil in large deep saucepan over medium-high heat (coconut milk will boil up high in pan). Reduce heat to mediumlow; boil until reduced to 1 1/2 cups, stirring occasionally, 25 to 30 minutes. Remove from heat; cool completely. Transfer to small bowl. Cover; chill (coconut milk will settle slightly as it cools). DO AHEAD: Can be made 2 days ahead. Keep chilled.",
                    "Position rack in center of oven; preheat to 350°F. Line eighteen 1/3-cup muffin cups with paper liners. Whisk flour, baking powder, and salt in medium bowl. Using electric mixer, beat butter in large bowl until smooth. Add sugar; beat on medium-high speed until well blended, about 2 minutes. Add 2 eggs, 1 at a time, beating well after each addition and occasionally scraping down sides of bowl. Beat in seeds from vanilla bean and remaining egg. Add half of flour mixture; mix on low speed just until blended. Add 1 cup reduced coconut milk; mix just until blended. Add remaining flour mixture; mix on low speed just until blended. Divide batter among muffin cups. Bake cupcakes until tops spring back when gently touched and tester inserted into center comes out clean, about 20 minutes. Transfer cupcakes in pans to rack; cool 10 minutes. Carefully remove cupcakes from pans and cool completely on rack.",
                    "Using electric mixer, beat butter in large bowl until smooth. Add sugar, 1/3 cup reduced coconut milk, seeds from vanilla bean, and salt. Beat on medium-low speed until blended, scraping down sides of bowl. Increase to mediumhigh and beat until light and fluffy.",
                    "Using pastry bag fitted with large star tip, pipe frosting onto cooled cupcakes. (Alternatively, top each cupcake with 2 tablespoons frosting. Using small offset spatula, swirl frosting over top of cupcakes, leaving 1/2-inch plain border.) Sprinkle with coconut. DO AHEAD: Can be made 1 day ahead. Store in airtight containers; chill. Bring to room temperature before serving.",
                    "Available at many supermarkets and at Indian, Southeast Asian, and Latin markets."
                ],
                "fat": 30.0,
                "date": "2009-03-04T04:00:00.000Z",
                "categories": [
                    "Cake",
                    "Mixer",
                    "Egg",
                    "Dessert",
                    "Bake",
                    "Kid-Friendly",
                    "Coconut",
                    "Vanilla",
                    "Birthday",
                    "Party",
                    "Butter",
                    "Bon Appétit",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 456.0,
                "desc": "The secret to these moist cupcakes? Reduced coconut milk.",
                "protein": 4.0,
                "rating": 4.375,
                "title": "Vanilla Bean-Coconut Cupcakes with Coconut Frosting ",
                "ingredients": [
                    "2 13-to 14-ounce cans unsweetened coconut milk* (preferably organic)",
                    "2 cups all purpose flour",
                    "2 1/4 teaspoons baking powder",
                    "1/2 teaspoon salt",
                    "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
                    "1 1/3 cups sugar",
                    "3 large eggs",
                    "Seeds scraped from 1 split vanilla bean or 1 1/2 teaspoons vanilla extract",
                    "1 cup reduced coconut milk (see above), room temperature",
                    "1 cup (2 sticks) unsalted butter, room temperature",
                    "2 1/2 cups powdered sugar",
                    "1/3 cup reduced coconut milk (see above), room temperature",
                    "Seeds scraped from 1 split vanilla bean or 1 1/2 teaspoons vanilla extract",
                    "1/8 teaspoon salt",
                    "1 1/2 cups sweetened flaked coconut, lightly toasted (for garnish)"
                ],
                "sodium": 148.0
            },
            "Lunch": {
                "directions": [
                    "Bring blueberries, 1/2 cup apple juice and sugar to boil in heavy medium saucepan. Simmer over medium heat until reduced to 2 cups, about 15 minutes. Dissolve 1 tablespoon cornstarch in remaining 2 tablespoons apple juice and add to blueberry mixture. Add lemon juice. Bring to boil, stirring constantly; simmer until thick, about 1 minute. Cool slightly. (Can be made 2 days ahead. Cover and refrigerate. Rewarm over medium-low heat before serving.)",
                    "Whisk first 6 ingredients in large bowl to blend. Whisk eggs, buttermilk, melted butter and lemon peel in small bowl to blend. Add buttermilk mixture all at once to flour mixture and whisk until just blended. Let mixture stand 15 minutes.",
                    "Preheat waffle iron according to manufacturer’s instructions. Spoon batter onto waffle iron. Cover and cook until golden and cooked through, about 7 minutes (cooking time will vary, depending on waffle iron). Repeat with remaining batter. Serve immediately with warm blueberry sauce."
                ],
                "fat": 18.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Berry",
                    "Dairy",
                    "Fruit",
                    "Breakfast",
                    "Brunch",
                    "Kid-Friendly",
                    "Mother's Day",
                    "New Year's Day",
                    "Blueberry",
                    "Lemon",
                    "Fall",
                    "Anniversary",
                    "Seed",
                    "Poppy",
                    "Bon Appétit",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 642.0,
                "desc": "There are only five employees at The Little Rooster Cafe, a small breakfast and lunch spot, but its terrific food and friendly service make it popular with locals and tourists (especially those who come to browse the town's outlet stores). Chef and co-owner Hub Poelmann features a different waffle every day. \"We have an open kitchen,\" he says. \"People smell the waffles cooking, and then order them.\" Poelmann credits his cooks with this lemon-poppy seed recipe, which was the happy result of \"playing around in the kitchen.\"",
                "protein": 14.0,
                "rating": 4.375,
                "title": "Lemon-Poppy Seed Waffles with Blueberry Sauce ",
                "ingredients": [
                    "1 pound frozen blueberries, thawed, undrained",
                    "1/2 cup plus 2 tablespoons apple juice",
                    "1/2 cup sugar",
                    "1 tablespoon cornstarch",
                    "1 tablespoon fresh lemon juice",
                    "1 1/2 cups all purpose flour",
                    "6 tablespoons sugar",
                    "2 tablespoons poppy seeds",
                    "1 1/2 teaspoons baking powder",
                    "1 teaspoon baking soda",
                    "1/4 teaspoon salt",
                    "3 large eggs",
                    "1 1/4 cups buttermilk",
                    "1/4 cup (1/2 stick) unsalted butter, melted",
                    "1 tablespoon grated lemon peel"
                ],
                "sodium": 802.0
            },
            "Dinner": {
                "directions": [
                    "In a small saucepan, combine maple syrup and rosemary. Bring to a boil, then reduce to a simmer, cover, and cook for 8 minutes. Remove saucepan from heat and keep covered until you're finished cooking the pancakes. When ready to serve, discard the rosemary and transfer rosemary syrup to a serving vessel.",
                    "In a large bowl, combine the flour, poppy seeds, sunflower seeds, baking powder, baking soda, and salt. In a separate medium bowl, whisk together buttermilk, eggs, melted butter, sugar, orange zest, and orange juice. Add the wet ingredients to the dry ingredients, and stir until just combined. (Do not overmix; the batter will be slightly lumpy.)",
                    "Heat a large skillet or griddle to medium and brush it with a bit of butter. Using a 1/4-cup scoop, drop batter onto skillet to form pancakes. Cook until bubbles start to form on the surface, 1 to 2 minutes. Flip and cook until lightly browned on the bottom, about 30 seconds more. Repeat with the remaining batter, brushing pan with butter as needed.",
                    "Serve pancakes topped with butter and drizzle with the rosemary syrup."
                ],
                "fat": 4.0,
                "date": "2015-02-17T04:00:00.000Z",
                "categories": [
                    "Breakfast",
                    "Brunch",
                    "Fry",
                    "Kid-Friendly",
                    "Quick & Easy",
                    "Orange",
                    "Rosemary",
                    "Poppy",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 167.0,
                "desc": "These fluffy pancakes get an extra dose of nutrition (not to mention serious crunch) from a combination of poppy and sunflower seeds. Use any citrus you like for the batter, but we're especially fond of how oranges pair with the rosemary-infused maple syrup. All-purpose flour may be substituted for spelt, however we love the unique nuttiness that spelt brings to this recipe.",
                "protein": 5.0,
                "rating": 0.0,
                "title": "Orange Poppy Seed Pancakes with Rosemary Maple Syrup ",
                "ingredients": [
                    "1 cup maple syrup",
                    "3 rosemary sprigs",
                    "2 cups spelt flour (or all-purpose flour)",
                    "1/3 cup poppy seeds",
                    "1/3 cup sunflower seeds",
                    "1 teaspoon baking powder",
                    "1/2 teaspoon baking soda",
                    "1/2 teaspoon salt",
                    "2 1/4 cups low-fat buttermilk",
                    "2 large eggs",
                    "2 tablespoons melted butter",
                    "1 tablespoon granulated sugar",
                    "1 1/2 tablespoons grated orange zest, plus 1/3 cup orange juice (from 1 large orange)",
                    "Unsalted butter, at room temperature, for pan and serving"
                ],
                "sodium": 191.0
            },
            "Snacks": {
                "directions": [
                    "Whisk chile, garlic, vinegar, soy sauce, vegetable oil, peanut butter, sesame oil, ginger, and 1 tsp. salt in a large bowl. Add snow peas and toss to combine.",
                    "Cook udon in a large pot of boiling salted water according to package directions. Add shrimp 3 minutes before noodles are done and cook, stirring occasionally, until shrimp are pink and cooked through. Drain noodles and shrimp and add to dressing; stir vigorously to combine.",
                    "Transfer noodle mixture to a serving bowl or platter. Top with peanuts and cilantro. Serve immediately or at room temperature."
                ],
                "fat": 20.0,
                "date": "2015-07-13T04:00:00.000Z",
                "categories": [
                    "Kid-Friendly",
                    "Quick & Easy",
                    "Dinner",
                    "Lunch",
                    "Peanut",
                    "Shrimp",
                    "Pea",
                    "Spring",
                    "Summer",
                    "Noodle",
                    "Cilantro",
                    "Soy Sauce",
                    "Pescatarian",
                    "Dairy Free",
                    "Tree Nut Free",
                    "No Sugar Added"
                ],
                "calories": 545.0,
                "desc": null,
                "protein": 28.0,
                "rating": 4.375,
                "title": "Udon Noodles with Shrimp, Snow Peas, and Peanuts ",
                "ingredients": [
                    "1 red chile (such as Fresno), finely chopped",
                    "1 garlic clove, finely chopped",
                    "6 tablespoons unseasoned rice vinegar",
                    "6 tablespoons soy sauce",
                    "3 tablespoons vegetable oil",
                    "2 tablespoons peanut butter",
                    "2 teaspoons sesame oil",
                    "1 tablespoon finely grated peeled ginger",
                    "1 teaspoon kosher salt, plus more to taste",
                    "2 cups snow peas, thinly sliced (about 8 ounces)",
                    "1 pound udon noodles",
                    "1 pound shrimp, peeled, deveined",
                    "1/3 cup coarsely chopped roasted salted peanuts",
                    "1/4 cup coarsely chopped fresh cilantro"
                ],
                "sodium": 1362.0
            }
        },
        "Day 3": {
            "Breakfast": {
                "directions": [
                    "Preheat oven to 350°F.",
                    "In food processor, process cookies and walnuts until finely ground. Press crumbs onto bottom and 1 inch up sides of 9-inch-diameter springform pan. Bake until golden and fragrant, about 10 minutes. Transfer to rack to cool.",
                    "In medium saucepan over moderate heat, combine sliced strawberries, rhubarb, and 1/3 cup sugar. Simmer, stirring often, until soft, about 6 minutes. Remove pan from heat and set aside.",
                    "In large metal bowl using handheld electric mixer, beat eggs and remaining 1/2 cup sugar until foamy. Beat in hot strawberry-rhubarb mixture. Place bowl atop saucepan of barely simmering water and beat at moderately high speed until instant-read thermometer registers 140°F, about 5 minutes. Turn off heat and continue beating 3 minutes more. Remove bowl from saucepan and let custard cool, stirring occasionally, until room temperature. Cover and chill 30 minutes.",
                    "In large bowl, combine mascarpone, 1/4 cup heavy cream, and vanilla. Using handheld electric mixer with clean beaters, beat mixture at low speed until combined. Gradually beat in remaining cream, then beat at moderately high speed until mixture just holds stiff peaks. Fold mixture into chilled custard, then pour into springform pan, smoothing top. Wrap well in plastic wrap and freeze until firm but not frozen solid, about 3 hours.",
                    "To serve, unwrap and let stand at room temperature 20 minutes to soften slightly. Place tart on serving platter and remove sides of pan. Garnish with remaining strawberries."
                ],
                "fat": 26.0,
                "date": "2007-03-12T21:23:38.000Z",
                "categories": [
                    "Food Processor",
                    "Mixer",
                    "Berry",
                    "Cheese",
                    "Dairy",
                    "Egg",
                    "Fruit",
                    "Nut",
                    "Dessert",
                    "Bake",
                    "Freeze/Chill",
                    "Chill",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 451.0,
                "desc": "A semifreddo is a frozen, molded mousse. Here, we combine it with a walnut-shortbread crust for a tart that celebrates the coming of spring fruit.",
                "protein": 6.0,
                "rating": 4.375,
                "title": "Strawberry-Rhubarb Semifreddo ",
                "ingredients": [
                    "2 (5 1/3-ounce) boxes all-butter shortbread cookies, broken into pieces",
                    "1/2 cup walnut halves",
                    "1 pint strawberries, enough hulled and thinly sliced to make 3/4 cup, and remainder reserved for garnish",
                    "1/2 pound fresh rhubarb stalks, peeled and sliced crosswise into 1/2-inch chunks",
                    "1/3 cup plus 1/2 cup sugar",
                    "2 large eggs",
                    "1/2 cup mascarpone cheese",
                    "1 1/2 cups heavy cream",
                    "1 teaspoon pure vanilla extract"
                ],
                "sodium": 214.0
            },
            "Lunch": {
                "directions": [
                    "Pulse first 4 ingredients in a blender until combined; season with salt and pepper. With blender running, slowly drizzle in oil. Process dressing until well blended.",
                    "Place remaining ingredients in a large bowl; drizzle with 3 tablespoons dressing and toss to coat. Pass remaining dressing alongside for drizzling over."
                ],
                "fat": 38.0,
                "date": "2012-05-08T04:00:00.000Z",
                "categories": [
                    "Salad",
                    "Rice",
                    "Tomato",
                    "Side",
                    "Picnic",
                    "Vegetarian",
                    "High Fiber",
                    "Lunch",
                    "Pea",
                    "Radish",
                    "Squash",
                    "Summer",
                    "Healthy",
                    "Low Cholesterol",
                    "Vegan",
                    "Bon Appétit",
                    "Sugar Conscious",
                    "Pescatarian",
                    "Dairy Free",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Soy Free",
                    "No Sugar Added",
                    "Kosher"
                ],
                "calories": 656.0,
                "desc": "Create endless riffs on this salad by using the bright herb dressing with your favorite grains and vegetables.",
                "protein": 9.0,
                "rating": 3.75,
                "title": "Basmati Rice with Summer Vegetable Salad ",
                "ingredients": [
                    "1 small shallot, chopped",
                    "2 tablespoons chopped flat-leaf parsley",
                    "2 tablespoons red wine vinegar",
                    "2 teaspoons fresh thyme leaves",
                    "Kosher salt, freshly ground pepper",
                    "1/3 cup extra-virgin olive oil",
                    "2 cups cooked basmati rice, cooled",
                    "2 cups bite-size pieces assorted vegetables (such as radishes, tomatoes, peas, summer squash) or carrot ribbons",
                    "3/4 cup torn mixed leafy greens, sprouts, and herbs",
                    "1/3 cup chopped red, yellow, or white onion or scallions",
                    "2 tablespoons toasted pine nuts (optional)"
                ],
                "sodium": 151.0
            },
            "Dinner": {
                "directions": [
                    "Bring butter, salt, pepper, and 1 cup water to a boil over high heat in a deep 12-inch heavy skillet, then add Brussels sprouts and simmer, partially covered, stirring occasionally, until crisp-tender, 6 to 8 minutes. Remove lid and boil over moderately high heat until water is evaporated and sprouts are lightly browned, 3 to 4 minutes. Add cream and remaining 1/4 cup water and bring to a boil, stirring. Add chestnuts, then reduce heat and simmer, stirring occasionally, until heated through, about 2 minutes."
                ],
                "fat": 14.0,
                "date": "2005-10-21T18:28:15.000Z",
                "categories": [
                    "Dairy",
                    "Nut",
                    "Vegetable",
                    "Side",
                    "Thanksgiving",
                    "Vegetarian",
                    "Quick & Easy",
                    "High Fiber",
                    "Fall",
                    "Chestnut",
                    "Brussel Sprout",
                    "Gourmet",
                    "Sugar Conscious",
                    "Pescatarian",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Soy Free",
                    "No Sugar Added",
                    "Kosher"
                ],
                "calories": 196.0,
                "desc": "A touch of cream transforms this dish into a sumptuous side that exposes the luxurious character of this often homely vegetable.",
                "protein": 5.0,
                "rating": 4.375,
                "title": "Brussels Sprouts with Chestnuts ",
                "ingredients": [
                    "2 tablespoons unsalted butter",
                    "3/4 teaspoon salt",
                    "1/2 teaspoon black pepper",
                    "1 1/4 cups water",
                    "2 lb Brussels sprouts, trimmed and halved lengthwise (8 cups)",
                    "1 cup heavy cream",
                    "2/3 cup bottled roasted whole chestnuts (4 oz), coarsely crumbled"
                ],
                "sodium": 260.0
            },
            "Snacks": {
                "directions": [
                    "Preheat oven to 350°F.",
                    "In a baking pan toast nuts in one layer in middle of oven until golden, about 10 minutes, and cool. Finely chop nuts and chocolate separately.",
                    "In a dry heavy saucepan cook sugar over moderately low heat, stirring slowly with a fork to help sugar melt evenly), until melted and pale golden. Cook caramel, without stirring, swirling pan, until deep golden. Remove pan from heat and carefully add cream down side of pan (mixture will bubble and steam). Simmer mixture, stirring occasionally, until caramel is dissolved. Stir in chocolate and nuts. Cool sauce 10 minutes and in a food processor blend until smooth.",
                    "Serve sauce warm. Sauce may be made 1 week ahead and chilled, covered. Reheat sauce to warm before serving."
                ],
                "fat": 42.0,
                "date": "2004-08-20T12:48:48.000Z",
                "categories": [
                    "Sauce",
                    "Chocolate",
                    "Dessert",
                    "Macadamia Nut",
                    "Gourmet",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 538.0,
                "desc": null,
                "protein": 3.0,
                "rating": 0.0,
                "title": "Chocolate Macadamia Nut Sauce ",
                "ingredients": [
                    "2/3 cup macadamia nuts (about 3 1/2 ounces)",
                    "1 ounce fine quality bittersweet chocolate (not unsweetened)",
                    "1/2 cup sugar",
                    "3/4 cup heavy cream"
                ],
                "sodium": 25.0
            }
        },
        "Day 4": {
            "Breakfast": {
                "directions": [
                    "Preheat oven to 325°F. Butter and flour 9x5x3-inch metal loaf pan. Whisk first 6 ingredients in medium bowl to blend. Using electric mixer, beat honey, sugar, oil and eggs in large bowl until blended, about 3 minutes. Beat in dry ingredients in 2 additions. Beat in 1/2 cup boiling water. Stir in raisins. Transfer batter to prepared pan. Bake until cake is brown and tester inserted into center comes out clean, about 1 hour 10 minutes. Cool cake in pan 10 minutes. Turn out onto rack; cool completely. (Can be prepared 1 day ahead. Wrap cake and store at room temperature.)"
                ],
                "fat": 15.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Cake",
                    "Mixer",
                    "Egg",
                    "Ginger",
                    "Dessert",
                    "Bake",
                    "Spice",
                    "Fall",
                    "Winter",
                    "Honey",
                    "Cinnamon",
                    "Clove",
                    "Bon Appétit",
                    "Mexico",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Dairy Free",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 444.0,
                "desc": "Delicious as an afternoon treat with a cup of coffee or tea.",
                "protein": 5.0,
                "rating": 4.375,
                "title": "Honey and Spice Loaf Cake ",
                "ingredients": [
                    "2 cups all purpose flour",
                    "1 1/2 teaspoons ground cinnamon",
                    "1 teaspoon ground ginger",
                    "1teaspoon baking soda",
                    "3/4 teaspoon salt",
                    "1/4 teaspoon ground cloves",
                    "2/3 cup honey",
                    "1/2 cup sugar",
                    "1/2 cup vegetable oil",
                    "2 large eggs",
                    "1/2 cup boiling water",
                    "1 cup raisins"
                ],
                "sodium": 398.0
            },
            "Lunch": {
                "directions": [
                    "Heat oven to 350°F with rack in middle. Invert bottom of springform pan (to make it easier to slide cake off bottom) and lock on side. Butter pan and line bottom with a round of parchment or wax paper. Butter paper, then dust paper with additional flour, knocking out excess.",
                    "Sift together flour, baking powder, baking soda, and salt into a bowl.",
                    "In a separate bowl, beat together butter and sugar with an electric mixer (fitted with paddle attachment if using a stand mixer) at medium-high speed until pale and fluffy, 3 to 5 minutes. Add in warmed eggs, one at a time, beating well after each addition, then beat in vanilla.",
                    "Reduce speed to low, then add flour mixture in 3 batches alternately with sour cream, beginning and ending with flour and mixing until batter is smooth. Spoon batter into springform pan, spreading evenly.",
                    "Bake cake until it begins to pull away from side of pan and a wooden toothpick inserted in center comes out clean, 35 to 40 minutes. Let cake cool in pan on a wire rack for 10 minutes, then carefully run a thin knife around edge of cake and remove side of pan. Invert cake onto rack, then remove bottom of pan and carefully peel off paper. Let cake cool completely.",
                    "Combine all ingredients except water and cornstarch in a 2- to 3-quart heavy saucepan and bring to a boil over medium-high heat, stirring frequently. Reduce heat and briskly simmer, uncovered, stirring occasionally, until reduced to about 1 1/4 cups, 8 to 10 minutes. Stir water into cornstarch in a small bowl, then stir into blueberry filling and gently boil, stirring, 1 minute. Transfer to a bowl and chill, uncovered, until cold.",
                    "Combine all ingredients except water and cornstarch in a 2- to 3-quart heavy saucepan and bring to a boil over medium-high heat, stirring frequently. Reduce heat and briskly simmer, uncovered, stirring occasionally, until reduced to about 1 1/4 cups, 10 to 12 minutes. Stir water into cornstarch in a small bowl, then stir into raspberry filling and gently boil, stirring, 1 minute. Force filling through a large fine-mesh sieve into a bowl, scraping bottom of sieve to release pulp into bowl. Discard solids in sieve. Chill filling, uncovered, until cold.",
                    "Cut cooled cake horizontally into 3 even layers with a long serrated knife (see Cooks' Notes for an easy method). Line 9-inch springform pan with 2 overlapping sheets of plastic wrap, letting excess hang over edge. Put bottom layer, cut side up, in pan. Spread cold blueberry filling over cake using offset spatula, leaving a 1/4-inch border around edge, then freeze until firm, about 20 minutes.",
                    "Slightly soften ice cream in microwave, then scoop half of it, preferably in thin curls that you can lay over blueberry layer, and gently spread it evenly to edge of cake. Return remaining ice cream to freezer. Put middle cake layer on top of ice cream, gently pressing it down, and spread cold raspberry filling over cake, leaving a 1/4-inch border around edge. Freeze cake until raspberry layer is firm, about 30 minutes.",
                    "Slightly soften remaining ice cream, if necessary, and spread in same manner evenly over raspberry filling to edge of cake. Put remaining cake layer on top of ice cream, cut side down, and gently press it down, then freeze cake, well wrapped in plastic, until very firm, 4 to 6 hours.",
                    "Beat heavy cream with confectioners' sugar and vanilla in a large deep bowl with an electric mixer until it just holds stiff peaks.",
                    "Remove side and bottom of springform pan and peel plastic from cake. Set cake on a serving plate that will fit in the freezer. Spread some of whipped cream in a thin layer around side and top of cake and freeze cake until cream is firm, about 30 minutes (meanwhile, keep remaining whipped cream cold in refrigerator).",
                    "Frost cake with remaining cream, leaving swirls in cream on top to help hold berries. Freeze until very firm, at least 30 minutes.",
                    "To serve, transfer cake to refrigerator to soften, 30 minutes to 1 hour, and garnish with berries."
                ],
                "fat": 36.0,
                "date": "2012-07-09T04:00:00.000Z",
                "categories": [
                    "Cake",
                    "Milk/Cream",
                    "Berry",
                    "Dairy",
                    "Dessert",
                    "Bake",
                    "Fourth of July",
                    "Blueberry",
                    "Raspberry",
                    "Summer",
                    "Birthday",
                    "Party",
                    "Gourmet",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 654.0,
                "desc": "When it comes to ice cream cakes, there are no hard-and-fast rules as to what form they can take. Some consist solely of ice cream molded and then decorated to resemble a cake, while others intersperse layers of ice cream with thin layers of cake, crisp meringue, or even crumbled cookies. Our red, white, and blue July 4th extravaganza is a gorgeous amalgam of ice cream, cake, and blueberries and raspberries cooked separately into their own jammy fillings. Frosted simply in sweetened whipped cream and topped with more berries, this cake sparkles as much as the fireworks in the sky!",
                "protein": 7.0,
                "rating": 4.375,
                "title": "Red, White, and Blue Ice Cream Cake ",
                "ingredients": [
                    "1 1/2 cups all-purpose flour plus more for dusting",
                    "1/2 teaspoon baking powder",
                    "1/4 teaspoon baking soda",
                    "1/4 teaspoon salt",
                    "1 stick (1/2 cup) unsalted butter, softened",
                    "1 cup sugar",
                    "2 large eggs, warmed in their shells in warm water for 5 minutes",
                    "1 teaspoon pure vanilla extract",
                    "1/2 cup sour cream",
                    "12 ounces (2 1/4 cups) fresh blueberries",
                    "1/3 cup sugar",
                    "2 tablespoons light corn syrup",
                    "1 teaspoon fresh lemon juice",
                    "1 teaspoon water",
                    "1 teaspoon cornstarch",
                    "12 ounces (3 cups) fresh raspberries",
                    "1/3 cup sugar",
                    "2 tablespoons light corn syrup",
                    "1 teaspoon fresh lemon juice",
                    "1 teaspoon water",
                    "1 1/2 teaspoons cornstarch",
                    "1 1/2 quarts vanilla ice cream",
                    "1 1/2 cups chilled heavy cream",
                    "1/3 cup confectioners sugar",
                    "1 teaspoon pure vanilla extract",
                    "1 cup mixed fresh blueberries and raspberries",
                    "Special equipment: A 9-inch springform pan; a small offset metal spatula"
                ],
                "sodium": 251.0
            },
            "Dinner": {
                "directions": [
                    "Place endive and watercress in large bowl. Mix vinegar and mustard in small bowl; slowly whisk in oil. Add mustard seeds. Season dressing with salt and pepper. Pour dressing over endive and watercress; toss to coat. Transfer salad to platter. Sprinkle with walnuts and cranberries and serve."
                ],
                "fat": 15.0,
                "date": "2004-10-07T21:19:45.000Z",
                "categories": [
                    "Salad",
                    "Mustard",
                    "Side",
                    "No-Cook",
                    "Vegetarian",
                    "Quick & Easy",
                    "Cranberry",
                    "Dried Fruit",
                    "Walnut",
                    "Fall",
                    "Healthy",
                    "Vegan",
                    "Endive",
                    "Watercress",
                    "Seed",
                    "Bon Appétit",
                    "Pescatarian",
                    "Dairy Free",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 182.0,
                "desc": null,
                "protein": 2.0,
                "rating": 3.75,
                "title": "Endive and Watercress Salad with Mustard Seed Vinaigrette ",
                "ingredients": [
                    "5 large heads of Belgian endive, trimmed, sliced crosswise into 1-inch pieces (about 6 cups)",
                    "2 bunches watercress, thick stems trimmed",
                    "1 tablespoon apple cider vinegar",
                    "2 teaspoons Dijon mustard",
                    "6 tablespoons olive oil",
                    "1 teaspoon mustard seeds",
                    "1/2 cup walnuts, toasted",
                    "1/2 cup dried cranberries"
                ],
                "sodium": 34.0
            },
            "Snacks": {
                "directions": [
                    "Bring 3 quarts water to boil in large saucepan. Add tapioca and boil until tapioca is clear, stirring occasionally, about 16 minutes. Drain; rinse under cold water until cool. Transfer tapioca to medium bowl.",
                    "Pour cream into heavy small saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer. Whisk egg yolks, sugar, and salt in medium bowl 1 minute. Gradually whisk hot cream mixture into yolks. Return mixture to saucepan and stir over medium heat until mixture is thick enough to coat back of spoon, about 5 minutes; do not boil. Transfer custard to medium metal bowl. Set over bowl of ice water and stir until custard is cool. Stir 3/4 cup custard into tapioca. Do ahead Can be made 1 day ahead. Cover and chill tapioca and remaining custard separately. Stir all remaining custard into tapioca to loosen before continuing.",
                    "Cook potatoes and parsnips in separate medium saucepans of boiling salted water until very tender, about 15 minutes. Drain vegetables well, then transfer to sieve set over medium bowl. Force potatoes and parsnips through sieve into bowl. Stir in milk. Whisk in flour in 3 additions. Add eggs 1 at a time, whisking to blend after each addition. Whisk sugar and salt into batter. Using electric mixer, beat egg whites until stiff but not dry. Fold egg whites into batter.",
                    "Line rimmed baking sheet with foil. Heat griddle over medium heat. Brush with oil. In batches, drop batter by rounded tablespoonfuls onto griddle, spreading to form 21/2- to 3-inch rounds. Cook until brown, about 21/2 minutes per side. Transfer to sheet. Do ahead Can be made 1 day ahead. Cool, cover tightly with foil, and chill. Rewarm uncovered in 350°F oven, about 7 minutes.",
                    "Divide tapioca among 8 small bowls. Place 1 bowl on each of 8 plates. Divide warm blinis among plates. Arrange dried cherry halves, candied apricot slices, and toasted pecans on plates. Place dollop of crme frache and honey and small mound of ground cinnamon on plates."
                ],
                "fat": 27.0,
                "date": "2006-11-28T04:02:26.000Z",
                "categories": [
                    "Mixer",
                    "Dairy",
                    "Egg",
                    "Fruit",
                    "Nut",
                    "Potato",
                    "Vegetable",
                    "Dessert",
                    "Christmas",
                    "Cocktail Party",
                    "Bon Appétit",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 565.0,
                "desc": "The classic caviar-topped blini goes sweet: Tender dessert blinis get trimmings and toppings — including tapioca \"caviar\" — for a create-your-own dessert.",
                "protein": 10.0,
                "rating": 2.5,
                "title": "Blinis with Tapioca Caviar, Candied Fruits, Toasted Pecans, and Crème Fraîche ",
                "ingredients": [
                    "3 quarts water",
                    "1/2 cup small pearl tapioca*",
                    "1 cup whipping cream",
                    "1 3-inch piece vanilla bean, split lengthwise",
                    "3 large egg yolks (reserve whites for blinis)",
                    "1/3 cup sugar",
                    "Pinch of salt",
                    "1/2 pound Yukon Gold potatoes, peeled, cut into 1/2-inch cubes (about 1 1/2 cups)",
                    "1/2 pound parsnips, peeled, cut into 1/2-inch cubes (about 1 1/2 cups)",
                    "1/4 cup whole milk",
                    "1/4 cup all purpose flour",
                    "3 large eggs",
                    "2 tablespoons sugar",
                    "1 teaspoon salt",
                    "3 large egg whites (reserved from tapioca)",
                    "Vegetable oil",
                    "1 cup candied red cherries, halved",
                    "1 cup candied or dried apricots (about 8 ounces), cut in half horizontally, then sliced crosswise into 1/4-inch-wide strips",
                    "1 cup pecans, toasted, coarsely broken",
                    "1 cup crème fraîche",
                    "1/2 cup honey",
                    "1/4 cup ground cinnamon",
                    "*Available at some supermarkets and specialty foods stores, and at Asian markets."
                ],
                "sodium": 422.0
            }
        },
        "Day 5": {
            "Breakfast": {
                "directions": [
                    "Blend first 3 ingredients in processor to combine. Add butter; using on/off turns, cut in until coarse meal forms. Add egg yolk, cream, and vanilla extract; process until moist clumps form. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour and up to 1 day.",
                    "Preheat oven to 350°F. Roll out dough on lightly floured surface to 11-inch round. Transfer dough to 9-inch fluted tart pan with removable bottom. Fold in overhang to form double-thick sides. Pierce dough all over with fork; freeze 15 minutes.",
                    "Bake crust until golden brown, about 25 minutes. Transfer to rack and cool completely. (Can be made 1 day ahead. Store airtight at room temperature.)",
                    "Stir 1/3 cup brown sugar, 3 tablespoons cream, and butter in medium saucepan over medium heat until sugar dissolves. Cool completely.",
                    "Using electric mixer, beat cream cheese, peanut butter, and vanilla in medium bowl until smooth. Stir in brown sugar mixture.",
                    "Using electric mixer, beat remaining 2 tablespoons brown sugar and 1/4 cup cream in another medium bowl until peaks form. Fold into peanut butter mixture. Transfer to crust; smooth top with spatula. Chill until set, about 3 hours.",
                    "Stir brown sugar, butter, 1/4 cup water, 2 tablespoons cream, and corn syrup in heavy medium saucepan over medium heat until sugar dissolves. Increase heat to high and boil without stirring until candy thermometer registers 238°F, about 7 minutes. Remove from heat. Stir in remaining 2 tablespoons cream and peanuts. Cool just to lukewarm, about 15 minutes.",
                    "Pour glaze atop filling, smoothing with spatula. Chill tart until set, about 30 minutes. (Can be made 1 day ahead. Keep chilled.) Cut into wedges and serve."
                ],
                "fat": 33.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Milk/Cream",
                    "Food Processor",
                    "Mixer",
                    "Nut",
                    "Dessert",
                    "Bake",
                    "Kid-Friendly",
                    "Cream Cheese",
                    "Peanut",
                    "Summer",
                    "Bon Appétit",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 446.0,
                "desc": "Christine Warren of New York, New York, writes: \"On a recent evening out on the town, my friends and I decided to go for Margaritas at Zarela. What started out as drinks soon turned into appetizers and then dessert (a well-balanced meal, in our view). We loved the divine peanut butter tart.\"",
                "protein": 6.0,
                "rating": 3.75,
                "title": "Peanut Butter Tart with Caramel-Peanut Glaze ",
                "ingredients": [
                    "1 1/4 cups all purpose flour",
                    "3 tablespoons sugar",
                    "1/2 teaspoon ground cinnamon",
                    "7 tablespoons chilled unsalted butter, cut into pieces",
                    "1 large egg yolk",
                    "2 teaspoons whipping cream",
                    "3/4 teaspoon vanilla extract",
                    "1/3 cup plus 2 tablespoons (packed) golden brown sugar",
                    "3 tablespoons plus 1/4 cup chilled whipping cream",
                    "2 tablespoons (1/4 stick) unsalted butter",
                    "3 ounces cream cheese, room temperature",
                    "1/4 cup creamy peanut butter, room temperature",
                    "1 teaspoon vanilla extract",
                    "1/2 cup (packed) golden brown sugar",
                    "6 tablespoons (3/4 stick) unsalted butter",
                    "1/4 cup water",
                    "4 tablespoons whipping cream",
                    "2 tablespoons light corn syrup",
                    "3/4 cup chopped lightly salted roasted peanuts"
                ],
                "sodium": 45.0
            },
            "Lunch": {
                "directions": [
                    "Bring 4 cups water to a boil in a 2-quart heavy saucepan, then add rice and 1/2 teaspoon salt. Reduce heat and cook, covered, over low heat until rice is tender and grains are split open, 1 to 1 1/4 hours (not all liquid will be absorbed). Drain well in a colander and cool to warm.",
                    "Blend together milk, eggs, 3 tablespoons butter, flour, pepper, remaining teaspoon salt, and 1 cup cooked wild rice in a blender until smooth, about 1 minute. Transfer to a large bowl and stir in scallions and 1 1/2 cups cooked wild rice (reserve remainder for another use). Let batter stand, covered, at room temperature 1 hour.",
                    "Roast bell peppers on racks of gas burners over high heat, turning with tongs, until skins are blackened, 10 to 12 minutes. (Or broil peppers on a broiler pan about 5 inches from heat, turning occasionally, about 15 minutes.) Transfer to a large bowl and cover tightly with plastic wrap, then let stand 20 minutes.",
                    "When cool enough to handle, peel peppers, discarding stems and seeds, and coarsely chop.",
                    "Purée peppers with water, oil, vinegar, and salt in cleaned blender until smooth. Season with pepper and pour into a small heavy saucepan.",
                    "Soak porcini in boiling-hot water in a small bowl until softened, about 20 minutes. Lift porcini out, squeezing liquid back into bowl, then rinse porcini (to remove any grit) and finely chop. Pour soaking liquid through a sieve lined with a dampened paper towel into another small bowl.",
                    "Heat oil and 1 tablespoon butter in a 12- to 13-inch nonstick skillet over moderately high heat until foam subsides, then sauté porcini and cremini mushrooms, tossing with 2 wooden spatulas or spoons, until wilted and any liquid mushrooms give off is evaporated, 3 to 5 minutes. Add garlic, rosemary, thyme, salt, and remaining tablespoon butter and sauté, stirring, 1 minute. Add porcini soaking liquid and boil until most of liquid is evaporated and mushrooms are tender, 3 to 5 minutes. Season with salt and pepper.",
                    "Line a plate with 1 square of wax paper. Heat crêpe pan over moderate heat until hot, then brush lightly with some melted butter. Spoon about 3 tablespoons batter into pan, tilting and rotating to coat bottom. (If batter sets before skillet is coated, reduce heat slightly for next crêpe.) Cook until underside is lightly browned, about 1 minute, then loosen crêpe with a heatproof plastic spatula and flip over with your fingers. Cook crêpe until other side is lightly browned, about 1 minute, and transfer to wax-paper-lined plate. Top crêpe with another square of wax paper. Make more crêpes with remaining batter, brushing pan lightly with butter as needed. (You will have extra crêpes.)",
                    "Preheat oven to 400°F.",
                    "Brush some melted butter on bottom of a large shallow baking pan (1 inch deep). Spread 1/4 cup filling over half of 1 crêpe, then fold other half over filling to form a half-moon. Fold half-moon in thirds, overlapping outer sections (see photo, opposite), and transfer to baking pan. Repeat procedure with 11 more crêpes, arranging in 1 layer in baking pan.",
                    "Brush crêpes generously with remaining melted butter and bake in upper third of oven until outsides are crisp and filling is heated through, about 15 minutes.",
                    "While crêpes are baking, heat sauce over low heat until hot, about 5 minutes.",
                    "Put 2 crêpes on each of 6 plates and serve with sauce."
                ],
                "fat": 35.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Mushroom",
                    "Onion",
                    "Pepper",
                    "Rice",
                    "Bake",
                    "Sauté",
                    "Thanksgiving",
                    "Vegetarian",
                    "Fall",
                    "Gourmet"
                ],
                "calories": 645.0,
                "desc": "For more information about cooking wild rice, see Born to Be Wild.",
                "protein": 19.0,
                "rating": 4.375,
                "title": "Scallion Wild Rice Crepes with Mushroom Filling and Red Pepper Sauce ",
                "ingredients": [
                    "4 cups water",
                    "1 cup wild rice (5 oz)",
                    "1 1/2 teaspoons salt",
                    "1 3/4 cups whole milk",
                    "4 large eggs",
                    "1 stick (1/2 cup) unsalted butter, melted and cooled slightly",
                    "1 cup all-purpose flour",
                    "1/4 teaspoon black pepper",
                    "3/4 cup thinly sliced scallions",
                    "3 red bell peppers (18 oz)",
                    "1/2 cup water",
                    "2 tablespoons olive oil",
                    "1 1/2 teaspoons balsamic vinegar",
                    "3/4 teaspoon salt",
                    "1 1/2 oz dried porcini mushrooms",
                    "3/4 cup boiling-hot water",
                    "2 tablespoons olive oil",
                    "2 tablespoons unsalted butter",
                    "1 1/2 lb fresh cremini mushrooms, trimmed and thinly sliced",
                    "3 large garlic cloves, minced",
                    "3/4 teaspoon minced fresh rosemary",
                    "3/4 teaspoon minced fresh thyme",
                    "3/4 teaspoon salt",
                    "Garnish: thinly sliced scallions",
                    "Special equipment: 16 (5-inch) squares of wax paper; a well-seasoned 6- to 7-inch crêpe pan or nonstick skillet"
                ],
                "sodium": 1275.0
            },
            "Dinner": {
                "directions": [
                    "Put oven rack in middle position and preheat oven to 350°F.",
                    "Whisk together all ingredients in a large bowl until sugar is dissolved, then pour through a fine-mesh sieve into a 1-quart glass measure. Divide custard evenly among cups, then transfer cups to baking pan. Bake in a hot water bath , pan covered loosely with foil, until custards are just set and a knife inserted in center of one comes out clean, 35 to 40 minutes.",
                    "Carefully transfer cups to a rack and cool to warm, about 30 minutes."
                ],
                "fat": 12.0,
                "date": "2006-03-01T04:00:00.000Z",
                "categories": [
                    "Milk/Cream",
                    "Egg",
                    "Dessert",
                    "Bake",
                    "Mother's Day",
                    "Back to School",
                    "Vanilla",
                    "Fall",
                    "Spring",
                    "Poker/Game Night",
                    "Maple Syrup",
                    "Gourmet",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Wheat/Gluten-Free",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 193.0,
                "desc": "Maple syrup and maple sugar infuse a simple vanilla custard with a rich caramelized flavor.",
                "protein": 5.0,
                "rating": 4.375,
                "title": "Maple Custard Cups ",
                "ingredients": [
                    "2 whole large eggs",
                    "2 large egg yolks",
                    "1 1/2 cups whole milk",
                    "1/2 cup heavy cream",
                    "1/4 cup dark amber or Grade B maple syrup",
                    "2 tablespoons granulated maple sugar (see cooks' note, below)",
                    "1/2 teaspoon vanilla",
                    "1/4 teaspoon salt",
                    "Special equipment: a 13- by 9-inch baking pan; 6 (6-oz) custard cups or ramekins"
                ],
                "sodium": 159.0
            },
            "Snacks": {
                "directions": [
                    "Combine first 6 ingredients in blender and blend until smooth. Let stand 1 hour at room temperature. Blend again before using.",
                    "Brush 8- to 9-inch-diameter nonstick skillet lightly with melted butter. Heat over medium-high heat. Pour scant 1/4 cupful batter into skillet, tilting to allow batter to coat bottom of skillet. Cook until crepe is golden on bottom, about 1 minute. Turn crepe over and cook until brown on bottom, about 45 seconds. Transfer to paper towel. Repeat with remaining batter, making about 24 crepes and stacking crepes between paper towels. Cool.",
                    "Combine cajeta, milk, and butter in heavy medium saucepan. Bring to boil. Reduce heat to medium and simmer until sauce is reduced to 2 3/4 cups, about 5 minutes. Remove from heat. Stir in Cognac.",
                    "Place 1 crepe on work surface. Spread with 1 tablespoon sauce. Sprinkle with 1 tablespoon chopped pecans. Fold crepe in half over filling, then in half again, forming triangle. Repeat with remaining crepes, sauce, and pecans. Arrange crepes in two 13x9x2-inch glass baking dishes. (Can be prepared 1 day ahead. Cover and chill crepes and remaining sauce separately. Rewarm sauce just until pourable before continuing.)",
                    "Preheat oven to 350°F. Pour remaining sauce over crepes. Bake until heated through, about 15 minutes. Sprinkle with any remaining pecans and serve."
                ],
                "fat": 30.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Milk/Cream",
                    "Egg",
                    "Nut",
                    "Dessert",
                    "Bake",
                    "Pecan",
                    "Brandy",
                    "Spring",
                    "Pan-Fry",
                    "Bon Appétit",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 550.0,
                "desc": "Crepas de Cajeta con Nuez",
                "protein": 13.0,
                "rating": 5.0,
                "title": "Crepes with Caramel Sauce and Toasted Pecans ",
                "ingredients": [
                    "2 1/2 cups whole milk",
                    "5 large eggs",
                    "1 cup all purpose flour",
                    "6 tablespoons (3/4 stick) unsalted butter, melted, cooled slightly",
                    "2 tablespoons sugar",
                    "3/4 teaspoon salt",
                    "Additional melted butter (for frying)",
                    "3 cups cajeta",
                    "3/4 cup whole milk",
                    "3 tablespoons unsalted butter",
                    "3 tablespoons Cognac or brandy",
                    "2 cups pecans, toasted, chopped"
                ],
                "sodium": 301.0
            }
        },
        "Day 6": {
            "Breakfast": {
                "directions": [
                    "Preheat oven to 250° F.",
                    "In a large shallow baking dish whisk together eggs, orange juice, milk, liqueur, brown sugar, and nutmeg. Add 4 bread slices and soak 2 minutes. Turn slices over and soak 2 minutes more. Transfer soaked bread slices to a tray and repeat procedure with remaining 4 bread slices.",
                    "In a large heavy skillet heat 1 1/2 tablespoons butter over moderate heat until foam subsides and cook half of coated bread slices until golden, about 3 minutes on each side. Transfer French toast as cooked to a baking sheet and keep warm in oven. Cook remaining bread slices in same manner.",
                    "Dust French toast with confectioners' sugar and serve with syrup."
                ],
                "fat": 19.0,
                "date": "2004-08-20T12:48:48.000Z",
                "categories": [
                    "Citrus",
                    "Dairy",
                    "Egg",
                    "Breakfast",
                    "Brunch",
                    "Quick & Easy",
                    "Fall",
                    "Gourmet",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 461.0,
                "desc": "Can be prepared in 45 minutes or less.",
                "protein": 18.0,
                "rating": 3.75,
                "title": "Orange Whole-Wheat French Toast ",
                "ingredients": [
                    "6 large eggs",
                    "1/2 cup fresh orange juice",
                    "1/3 cup milk",
                    "1/4 cup Grand Marnier or other orange-flavored liqueur",
                    "1 1/2 tablespoons packed brown sugar",
                    "1/4 teaspoon freshly grated nutmeg",
                    "8 slices homemade-type whole-wheat bread",
                    "3 tablespoons unsalted butter for frying",
                    "confectioners' sugar for dusting",
                    "warm maple syrup"
                ],
                "sodium": 411.0
            },
            "Lunch": {
                "directions": [
                    "Preheat oven to 350°F. Blend nuts, 6 tablespoons sugar and flour in processor until nuts are finely chopped. Add butter. Process until mixture begins to clump together, divide equally among four 4-inch-diameter tartlet pans with removable bottoms. Press mixture onto bottom and up sides of pans. Bake until crusts are golden and set, about 13 minutes. Transfer pans to racks; cool completely.",
                    "Combine wine, water and 1/3 cup sugar in large nonstick skillet. Scrape in seeds from vanilla bean; add bean. Stir over medium heat until sugar dissolves. Increase heat and boil until liquid is slightly thickened and reduced to generous 1/2 cup, about 5 minutes. Discard vanilla bean. Cool syrup to room temperature.",
                    "Combine cream cheese, preserves and 2 tablespoons vanilla syrup in processor; purée until smooth. Spoon filling into crusts; smooth tops. Refrigerate until set, about 1 hour. (Can be made 1 day ahead. Keep tartlets chilled. Cover syrup and let stand at room temperature.)",
                    "Transfer 2 tablespoons vanilla syrup into small bowl. Add apricots to syrup in skillet; toss gently to coat. Arrange apricot slices decoratively atop filling in crusts. Brush apricot slices with reserved 2 tablespoons vanilla syrup. Refrigerate tartlets 30 minutes. Serve chilled."
                ],
                "fat": 48.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Cheese",
                    "Fruit",
                    "Nut",
                    "Dessert",
                    "Bake",
                    "Cream Cheese",
                    "Apricot",
                    "Summer",
                    "Bon Appétit",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 638.0,
                "desc": "The tender nut crust and a vanilla bean syrup make these cheesecake-like tartlets extra special. Top with more nuts, if you like.",
                "protein": 6.0,
                "rating": 3.75,
                "title": "Apricot-Cream Cheese Tartlets in Macadamia Crust ",
                "ingredients": [
                    "1 cup coarsely chopped roasted macadamia nuts (about 5 ounces)",
                    "6 tablespoons plus 1/3 sugar",
                    "1/4 cup all purpose flour",
                    "1/4 cup (1/2 stick) unsalted butter, melted",
                    "1 cup semidry white wine (such as Chenin Blanc)",
                    "1/3 cup water",
                    "1 vanilla bean, split lengthwise",
                    "4 ounces cream cheese, room temperature",
                    "2 tablespoons apricot preserves",
                    "6 apricots, thinly sliced"
                ],
                "sodium": 114.0
            },
            "Dinner": {
                "directions": [
                    "Pulse cocoa, brown sugar, kosher salt, baking powder, and 2 1/2 cups flour in a food processor to combine. Add butter and pulse until largest pieces are pea-size.",
                    "Beat egg yolks, sour cream, and vanilla extract in a small bowl until smooth. With the motor running, stream sour cream mixture into food processor and process until dough forms a ball around the blade. Turn out dough onto a surface and knead several times until it is smooth and homogenous. Divide in half and form into 3/4\"-thick disks. Wrap in plastic and chill until firm, about 2 hours.",
                    "Place racks in upper and lower thirds of oven and preheat to 350°F. Let 1 disk of dough sit at room temperature until slightly softened, about 5 minutes.",
                    "Roll out dough on a lightly floured sheet of parchment paper, shifting often on sheet and dusting with more flour as needed to keep from sticking, to a 12\" square. Using a small offset spatula, spread half of Nutella over dough in a thin layer. Sprinkle half of nuts, 1 Tbsp. demerara sugar, and 1/2 tsp. sea salt over Nutella. Roll up dough to make a log, using parchment paper to help. Repeat with remaining dough, Nutella, nuts, 1 Tbsp. demerara sugar, and 1/2 tsp. sea salt.",
                    "Slice logs 1\" thick and transfer to parchment-lined baking sheets, spacing 1 1/2\" apart. Brush tops with egg and sprinkle lightly with more sea salt. Bake rugelach until centers are set and tops are firm to the touch, 25–30 minutes; let cool.",
                    "Dough can be made 1 month ahead. Freeze."
                ],
                "fat": 14.0,
                "date": "2015-12-01T16:32:00.000Z",
                "categories": [
                    "Bon Appétit",
                    "Dessert",
                    "Christmas",
                    "Kid-Friendly",
                    "Cookies",
                    "Pistachio",
                    "Chocolate",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 191.0,
                "desc": "Our slice-and-bake technique is easier to manage than shaping a crescent version—a touch of sanity during holiday baking madness.",
                "protein": 3.0,
                "rating": 2.5,
                "title": "Chocolate-Nut Rugelach ",
                "ingredients": [
                    "1/2 cup unsweetened cocoa powder",
                    "1/4 cup (packed) light brown sugar",
                    "1/2 teaspoon kosher salt",
                    "1/4 teaspoon baking powder",
                    "2 1/2 cups all-purpose flour, plus more",
                    "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into pieces",
                    "2 large egg yolks",
                    "1/3 cup sour cream",
                    "1 teaspoon vanilla extract",
                    "1 (13-ounce) jar Nutella, divided",
                    "1 1/2 cups finely chopped pistachios, pecans, and/or walnuts, divided",
                    "2 tablespoons demerara sugar, divided",
                    "1 teaspoon flaky sea salt, divided, plus more",
                    "1 large egg, beaten to blend"
                ],
                "sodium": 84.0
            },
            "Snacks": {
                "directions": [
                    "Preheat oven to 400°F. Lightly butter 9-inch-diameter glass pie plate. Whisk milk, egg, salt and pepper in medium bowl to blend. Mix in cheese, green onion and chili. Add bread and stir until moistened. Transfer mixture to prepared pie dish. Let stand until bread absorbs most of custard, pressing several times to submerge cubes, about 5 minutes.",
                    "Bake strata uncovered until light brown around edges, top is crusty and knife inserted into center comes out clean, about 20 minutes.",
                    "Combine salsa and chopped fresh cilantro in small bowl. Cut strata into wedges. Serve with salsa."
                ],
                "fat": 28.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Cheese",
                    "Dairy",
                    "Egg",
                    "Appetizer",
                    "Bake",
                    "Vegetarian",
                    "Quick & Easy",
                    "Bon Appétit",
                    "Pescatarian",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 536.0,
                "desc": null,
                "protein": 31.0,
                "rating": 3.75,
                "title": "Arizona Cheese Strata ",
                "ingredients": [
                    "1 cup milk",
                    "2 large eggs",
                    "1/2 teaspoon salt",
                    "1/2 teaspoon pepper",
                    "1 cup (packed) grated Monterey Jack cheese",
                    "3 tablespoons sliced green onion",
                    "2 teaspoons minced jalapeño chili",
                    "2 cups cubed white sandwich bread (about 3 slices)",
                    "1/2 cup bottled chunky salsa",
                    "2 tablespoons chopped fresh cilantro"
                ],
                "sodium": 1800.0
            }
        },
        "Day 7": {
            "Breakfast": {
                "directions": [
                    "Set fine metal strainer over medium bowl and set aside. Whisk eggs, egg yolks, and sugar in another medium metal bowl to blend. Whisk in lime juice. Set bowl over large saucepan of gently simmering water (do not allow bottom of bowl to touch water). Whisk constantly until curd thickens and instant-read thermometer inserted into curd registers 178°F to 180°F, about 6 minutes. Immediately pour curd through prepared strainer set over bowl. Add butter to warm strained curd; let stand 1 minute, then whisk until blended and smooth. Press plastic wrap directly onto surface of curd, covering completely. Refrigerate until cold, about 4 hours. DO AHEAD: Lime curd can be made up to 2 days ahead. Keep chilled.",
                    "Using electric mixer, beat butter and sugar in medium bowl until well blended, 1 to 2 minutes. Add egg yolk; beat to blend. Add flour and salt and mix on low speed until mixture resembles large peas. Using hands, knead in bowl just until dough comes together.",
                    "Transfer dough to 9-inch-diameter tart pan with removable bottom. Break dough into pieces, then press dough evenly up sides and onto bottom of pan. Cover and chill 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
                    "Preheat oven to 350°F. Uncover crust and bake until golden brown, about 35 minutes. Cool completely in pan on rack.",
                    "Remove sides from tart pan and place crust on plate. Spread lime curd evenly in baked crust. Arrange blackberries in 2 concentric circles just inside edge of tart. Mound blueberries in center of tart. Place jam in small microwave-safe bowl. Heat in microwave until jam is melted, about 15 seconds. Whisk to loosen and blend, adding water by teaspoonfuls if thick. Brush jam over berries. DO AHEAD: Tart can be made up to 8 hours ahead. Chill uncovered."
                ],
                "fat": 25.0,
                "date": "2010-05-14T04:00:00.000Z",
                "categories": [
                    "Mixer",
                    "Egg",
                    "Dessert",
                    "Bake",
                    "High Fiber",
                    "Wedding",
                    "Blackberry",
                    "Blueberry",
                    "Lime",
                    "Summer",
                    "Family Reunion",
                    "Shower",
                    "Engagement Party",
                    "Candy Thermometer",
                    "Butter",
                    "Bon Appétit",
                    "Kidney Friendly",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 467.0,
                "desc": "A press-in crust makes this party-worthy dessert easy to put together. For a pretty presentation, don't cover the lime curd completely with berries. The contrast between the dark berries and the bright lime curd is striking.",
                "protein": 7.0,
                "rating": 4.375,
                "title": "Lime Tart with Blackberries and Blueberries ",
                "ingredients": [
                    "3 large eggs",
                    "3 large egg yolks",
                    "1 cup sugar",
                    "3/4 cup fresh lime juice",
                    "6 tablespoons (3/4 stick) unsalted butter, cut into 6 pieces",
                    "2 6-ounce containers fresh blackberries",
                    "1 6-ounce container fresh blueberries",
                    "1 tablespoon blackberry jam",
                    "1/2 cup (1 stick) unsalted butter, room temperature",
                    "1/4 cup sugar",
                    "1 large egg yolk",
                    "1 1/4 cups all purpose flour",
                    "1 large pinch of salt"
                ],
                "sodium": 81.0
            },
            "Lunch": {
                "directions": [
                    "Cook pasta in large pot of boiling salted water until tender but still firm to bite, or according to directions on package. Drain.",
                    "Melt butter in heavy large skillet over medium-high heat. Add walnuts; sauté until golden, about 2 minutes. Add garlic; sauté 30 seconds. Add wine. Simmer until slightly reduced, about 2 minutes. Add parsley and rosemary. Simmer 1 minute. Add ravioli and toss to coat with sauce. Season with salt and pepper; serve."
                ],
                "fat": 34.0,
                "date": "2004-08-20T04:00:00.000Z",
                "categories": [
                    "Cheese",
                    "Garlic",
                    "Herb",
                    "Nut",
                    "Sauté",
                    "Vegetarian",
                    "Quick & Easy",
                    "Rosemary",
                    "Walnut",
                    "Parsley",
                    "Bon Appétit"
                ],
                "calories": 629.0,
                "desc": "This rich, satisfying main course would be nice with a salad of chopped fresh tomatoes, yellow bell peppers, black olives, and sweet onion. Crusty breadsticks round out the meal, which might end with a plate of assorted grape clusters and anise biscuits.",
                "protein": 19.0,
                "rating": 3.125,
                "title": "Ravioli with Herbed Walnut Sauce ",
                "ingredients": [
                    "1 pound purchased cheese ravioli",
                    "1/4 cup (1/2 stick) butter",
                    "3/4 cup coarsely chopped walnuts",
                    "3 garlic cloves, minced",
                    "1 cup dry white wine",
                    "1/4 cup chopped fresh parsley",
                    "1 tablespoon chopped fresh rosemary"
                ],
                "sodium": 467.0
            },
            "Dinner": {
                "directions": [
                    "Preheat oven to 400°F. Butter twelve 1/3-cup metal muffin cups. Melt butter in heavy medium skillet over medium heat. Add corn and chili powder. Sauté 3 minutes. Transfer to medium bowl. Mix in buttermilk, then eggs. Cool completely.",
                    "Whisk cornmeal, flour, sugar, baking powder, salt and baking soda in large bowl to blend. Add buttermilk mixture; stir just until blended.",
                    "Divide batter among prepared muffin cups. Bake until tester inserted into center of muffins comes out clean, about 20 minutes. Transfer muffins to rack. Cool slightly. (Can be made 2 weeks ahead. Cool completely. Wrap in foil, seal in plastic bag and freeze. Rewarm muffins wrapped in foil in 350°F oven until heated through, about 8 minutes.)"
                ],
                "fat": 9.0,
                "date": "2004-08-20T12:48:48.000Z",
                "categories": [
                    "Bread",
                    "Bake",
                    "Super Bowl",
                    "Thanksgiving",
                    "Vegetarian",
                    "Cornmeal",
                    "Corn",
                    "Hot Pepper",
                    "Fall",
                    "Bon Appétit"
                ],
                "calories": 205.0,
                "desc": "Corn kernels and chili powder lend a southwestern accent to these muffins. They would also be nice alongside a bowl of chili.",
                "protein": 4.0,
                "rating": 3.75,
                "title": "Chili Cornmeal Muffins ",
                "ingredients": [
                    "1/2 cup (1 stick) unsalted butter",
                    "1 cup frozen corn kernels, thawed",
                    "4 teaspoons chili powder",
                    "1 cup buttermilk",
                    "2 large eggs",
                    "1 cup yellow cornmeal",
                    "1 cup all purpose flour",
                    "3 tablespoons sugar",
                    "2 teaspoons baking powder",
                    "1 teaspoon salt",
                    "1/2 teaspoon baking soda"
                ],
                "sodium": 386.0
            },
            "Snacks": {
                "directions": [
                    "Preheat oven to 350°F.",
                    "In an 8-inch non-stick skillet melt 1 tablespoon butter over moderate heat and in bowl toss with bread cubes. On a baking sheet toast bread cubes in middle of oven until pale golden and crisp, about 10 minutes, and transfer to a bowl.",
                    "Peel sweet potato and cut into 1/4-inch dice. In a steamer set over boiling water steam potato and onion until tender, about 4 minutes, and toss with croutons. Cool mixture and toss with goat cheese and rosemary. In a bowl whisk together eggs and salt and pepper to taste. In skillet heat 1/2 tablespoon butter over moderately high heat until foam subsides. Pour in half of eggs, tilting skillet to spread evenly over bottom. Cook omelet 1 minute, or until almost set, stirring top layer with back of fork and shaking skillet, letting any uncooked egg run underneath. Sprinkle half of omelet with half of crouton mixture and cook 1 minute more, or until set. Fold omelet over filling and transfer to a plate. Keep omelet warm while making another omelet with remaining 1/2 tablespoon butter, eggs, and crouton mixture in same manner."
                ],
                "fat": 30.0,
                "date": "2004-08-20T12:48:48.000Z",
                "categories": [
                    "Cheese",
                    "Egg",
                    "Onion",
                    "Potato",
                    "Brunch",
                    "Quick & Easy",
                    "Spring",
                    "Gourmet",
                    "Vegetarian",
                    "Pescatarian",
                    "Peanut Free",
                    "Tree Nut Free",
                    "Soy Free",
                    "Kosher"
                ],
                "calories": 545.0,
                "desc": "Can be prepared in 45 minutes or less.",
                "protein": 26.0,
                "rating": 3.125,
                "title": "Goat Cheese, Sweet Potato, and Crouton Omelets ",
                "ingredients": [
                    "2 tablespoon unsalted butter",
                    "1 cup 1/2-inch cubes country-style bread",
                    "1 small sweet potato (about 1/2 pound)",
                    "1 small red onion, sliced thin",
                    "2 ounces soft mild goat cheese, crumbles (about 1/4 cup)",
                    "1 teaspoon minced fresh rosemary leaves",
                    "5 large eggs"
                ],
                "sodium": 520.0
            }
        }
    }
}